---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralLoadFailures.CannotMirrorBoundaryCondition
source: html/b60b3346-0346-24d8-ab0d-66caf947f27d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralLoadFailures.CannotMirrorBoundaryCondition Property

Can't mirror Boundary Conditions

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMirrorBoundaryCondition { get; }
```